# Duct Fitting And Accessory Data Dynamic Viscosity Property

Source: https://www.revitapidocs.com/2026/fd65feaa-bf6d-3f17-c278-01648880a9e4.htm

---

| Duct Fitting And Accessory Data Dynamic Viscosity Property |
| --- |

The dynamic viscosity of air for the duct fitting or duct accessory, Units: (kg/(ft·s)).
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double DynamicViscosity { get; }
```

```
Public ReadOnly Property DynamicViscosity As Double
	Get
```

```
public:
property double DynamicViscosity {
	double get ();
}
```

```
member DynamicViscosity : float with get
```

#### Property Value

Double See Also

#### Reference

DuctFittingAndAccessoryData Class Autodesk.Revit.DB.Mechanical Namespace